package com.example;
/*2026_02_26 DZ_5+group
Создать базу  данных People
создать в этой базе таблицу Person с полями:
        -id -  Целые числа (индентификатор)
-age -  Целые числа
-salary - Десятичные дробные числа
-passport  - Строки с фиксированной длиной (10 символов)
-address -  Строки с переменной длиной (до 200 символов)
-dateOfBirthday - Дата
-dateTimeCreate- Дата и время
-timeToLunch -  Время
letter- Текст большого объёма

Создать Dao для Person. Создать PullRequest.
Групповое задание.
Используя аннатации над классом и полями класса DTO создать универсальную реализацию DAO для crud операций,
используя рефлексию.*/

public class App5DAO {

}
